// ReSharper disable CommentTypo
namespace Kontur.Extern.Client.ApiLevel.Models.DraftsBuilders.Info
{
    /// <summary>
    /// Код заявления
    /// </summary>
    public enum ApplicationCode
    {
        #region ip

        /// <summary>
        /// Заявление о государственной регистрации физического лица в качестве индивидуального предпринимателя
        /// </summary>
        Р21001,

        /// <summary>
        /// Заявление о государственной регистрации крестьянского (фермерского) хозяйства
        /// </summary>
        Р21002,

        /// <summary>
        /// Заявление о внесении изменений в сведения об индивидуальном предпринимателе, содержащиеся в Едином государственном реестре индивидуальных предпринимателей
        /// </summary>
        Р24001,

        /// <summary>
        /// Заявление о внесении изменений в сведения о главе крестьянского (фермерского) хозяйства, содержащиеся в Едином государственном реестре индивидуальных предпринимателей
        /// </summary>
        Р24002,

        /// <summary>
        /// Заявление о государственной регистрации прекращения физическим лицом деятельности в качестве индивидуального предпринимателя в связи с принятием им решения о прекращении данной деятельности
        /// </summary>
        Р26001,

        /// <summary>
        /// Заявление о государственной регистрации прекращения крестьянского (фермерского) хозяйства, в связи с решением членов крестьянского (фермерского) хозяйства
        /// </summary>
        Р26002,

        #endregion ip

        #region ul

        /// <summary>
        /// Заявление о государственной регистрации юридического лица
        /// </summary>
        Р11001,

        /// <summary>
        /// Заявление о государственной регистрации юридического лица, создаваемого путем реорганизации
        /// </summary>
        Р12001,

        /// <summary>
        /// Уведомление о начале процедуры реорганизации
        /// </summary>
        Р12003,

        /// <summary>
        /// Заявление о государственной регистрации в связи с завершением реорганизации юридического лица (юридических лиц)
        /// </summary>
        Р12016,

        /// <summary>
        /// Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица
        /// </summary>
        Р13001,

        /// <summary>
        /// Заявление о государственной регистрации изменений, внесенных в учредительный документ юридического лица, и (или) о внесении изменений в сведения о юридическом лице, содержащиеся в Едином государственном реестре юридических лиц
        /// </summary>
        Р13014,

        /// <summary>
        /// Заявление о внесении в Единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы
        /// </summary>
        Р14001,

        /// <summary>
        /// Заявление о внесении в Единый государственный реестр юридических лиц сведений о том, что хозяйственное общество находится в процессе уменьшения уставного капитала
        /// </summary>
        Р14002,

        /// <summary>
        /// Уведомление о ликвидации юридического лица
        /// </summary>
        Р15001,

        /// <summary>
        /// Заявление (уведомление) о ликвидации юридического лица
        /// </summary>
        Р15016,

        /// <summary>
        /// Заявление о государственной регистрации юридического лица в связи с его ликвидацией
        /// </summary>
        Р16001,

        /// <summary>
        /// Заявление о государственной регистрации прекращения унитарного предприятия или учреждения
        /// </summary>
        Р16002,

        /// <summary>
        /// Заявление о внесении записи о прекращении деятельности присоединенного юридического лица
        /// </summary>
        Р16003,

        /// <summary>
        /// Заявление (уведомление) о государственной регистрации международной компании, международного фонда
        /// </summary>
        Р18002

        #endregion ul
    }
}